GetLoadPatternsSelectedForDisplay
Syntax
cDatabaseTables.GetLoadPatternsSelectedForDisplay
VB6 Procedure
Function GetLoadPatternsSelectedForDisplay (ByRef NumberSelectedLoadPatterns As Integer, ByRef LoadPatternList As As String()) As Integer
Parameters
NumberSelectedLoadPatterns
Returned Item: The number of load pattern selected for table display.
LoadPatternList
Returned Item: The zero-based list of load patterns selected for table display.
Remarks
Returns a list of load patterns that are selected for table display.
This list sets the load patterns that are included when displaying load assignments on the model.
Release Notes
Initial release in version 23.0.0
See Also
SetLoadPatternsSelectedForDisplay